       IDENTIFICATION DIVISION.
       PROGRAM-ID. SRC-AMP-IO.
       
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01    DATOS.
             03  NOMBRE         PIC X(15).
             03  APELLIDOS      PIC X(15).
             03  DIRECCION      PIC X(20).
             03  POBLACION      PIC X(20).
             03  PROVINCIA      PIC X(20).
             66  DAT1 RENAMES NOMBRE THRU APELLIDOS.
             66  DAT2 RENAMES DIRECCION THRU POBLACION.
       
       PROCEDURE DIVISION.
       COMIENZO.

            DISPLAY "NOMBRE....:" LINE  8 POSITION 20 ERASE.
            DISPLAY "APELLIDOS.:" LINE 10 POSITION 20.
            DISPLAY "DIRECCION.:" LINE 12 POSITION 20.
            DISPLAY "POBLACION.:" LINE 14 POSITION 20.
            DISPLAY "PROVINCIA.:" LINE 16 POSITION 20.

      * PETICION DE LOS CAMPOS.

            ACCEPT NOMBRE LINE 8 POSITION 31 NO BEEP.
            ACCEPT APELLIDOS LINE 10 POSITION 31 NO BEEP.
            ACCEPT DIRECCION LINE 12 POSITION 31 NO BEEP.
            ACCEPT POBLACION LINE 14 POSITION 31 NO BEEP.
            ACCEPT PROVINCIA LINE 16 POSITION 31 NO BEEP.

      * IMPRESION DEL NOMBRE COMPLETO, LA DIRECCION Y LA POBLACION.

            DISPLAY DAT1 LINE 18 POSITION 15.
            DISPLAY DAT2 LINE 20 POSITION 15.

            STOP RUN.
       END PROGRAM SRC-AMP-IO.
                                       
