       IDENTIFICATION DIVISION.
       PROGRAM-ID. SRC-AMP-IO.
       
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01    LETRAS     PIC X(15) VALUE SPACES.
       01    NUMEROS    PIC 9(08) VALUE ZEROS.
       
       PROCEDURE DIVISION.
       COMIENZO.
            
            MOVE "CADENA LITERAL" TO LETRAS.
            DISPLAY LETRAS LINE 6 POSITION 20 ERASE.
            MOVE 1250000 TO NUMEROS.
            DISPLAY NUMEROS LINE 7 POSITION 20.

            DISPLAY "USO DE LA CONSTATNTE FIGUURATIVA 'HIGH-VALUES'"
                        LINE 9 POSITION 30.
            MOVE HIGH-VALUES TO LETRAS.
            DISPLAY LETRAS LINE 10 POSITION 20.
            MOVE HIGH-VALUES TO NUMEROS.
            DISPLAY NUMEROS LINE 11 POSITION 20.

            DISPLAY "USO DE LA CONSTANTE FIGURATIVA 'LOW-VALUES'"
                        LINE 13 POSITION 30.
            MOVE LOW-VALUES TO LETRAS.
            DISPLAY LETRAS LINE 14 POSITION 20.
            MOVE LOW-VALUES TO NUMEROS.
            DISPLAY NUMEROS LINE 15 POSITION 20.

            STOP RUN.
       END PROGRAM SRC-AMP-IO.
                                       
