       IDENTIFICATION DIVISION.
       PROGRAM-ID. SRC-AMP-IO.
       
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01    SALUDO      PIC X(21) VALUE "HOLA ME LLAMO PC".
       01    DESPEDIDA   PIC X(14) VALUE "HASTA OTRA VEZ".
       01    NUMERO      PIC 9(04) VALUE 1250.
       
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY SALUDO LINE 8 POSITION 10 ERASE.
            DISPLAY DESPEDIDA LINE 10 POSITION 10.
            DISPLAY NUMERO LINE 12 POSITION 10.
            STOP RUN.
       END PROGRAM SRC-AMP-IO.
