       IDENTIFICATION DIVISION.
       PROGRAM-ID. SRC-AMP-IO.
       
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       77  VECES               PIC 9(02).
       77  NUMERO              PIC 9(02).
       77  NUMAS1              PIC 9(02).
       77  BORRA               PIC X(15) VALUE SPACES.
       77  AUXIL               PIC X(15).
       77  TECLA               PIC X(1).
       01  TABLA.
           03 NOMBRE          PIC X(15) OCCURS 10 TIMES.

       PROCEDURE DIVISION.
       COMIENZO.

      * PONEMOS A CERO LS VARIABLES NUMERO Y VECES.
            MOVE 0 TO NUMERO, VECES.

       PIDENOMBRES.

      * SE SUMA UNO A NUMERO QUE VA A SER EL QUE VAYA CONTANDO
      * EL NUMERO DE NOMBRES QUE LLEVAMOS PEDIDOS.

            COMPUTE NUMERO = NUMERO + 1.
            DISPLAY "DAME EL NOMBRE " LINE 12 POSITION 20 ERASE.
            DISPLAY NUMERO LINE 12 POSITION 35.
            DISPLAY BORRA LINE 13 POSITION 20.

      * PEDIMOS EL NOMBRE Y PREGUNTAMOS SI YA HEMOS PEDIDO DIEZ
      * EN CASO DE NO SER ASI VOLVEMOS A SEGUIR PIDIENDO.

            ACCEPT NOMBRE(NUMERO) LINE 33 POSITION 20 NO BEEP.
            IF NUMERO < 10 GO TO PIDENOMBRES.

       ORDENACION1.

      * PRINCIPIO DE LA ORDENACION
      * LA VARIABLE VECES CONTARA EL BUCLE EXTERIOR QQUE SE HABRA.
      * DE EJECUTAR DIEZ VECES, ESTE BUCLE TERMINA EN FINORDENACION.
            COMPUTE VECES = VECES + 1.
            MOVE 0 TO NUMERO.

       ORDENACION2.

            COMPUTE NUMERO = NUMERO + 1.
            COMPUTE NUMAS1 = NUMERO + 1.

      * SI EL NOMBRE DE INDICE NUMERO ES MAYOR QUE EL NOMBRE DE.
      * INDICE NUMAS1 QUE ES NUMERO MAS 1. INTERCAMBIAMOS SUS.
      * PUESTOS PARA ORDENARLOS, PARA ELLO NOS AYUDAMOS DE LA.
      * VARIABLE AUXILIAR AUXIL.

            IF NOMBRE(NUMERO) > NOMBRE(NUMAS1)
                      MOVE NOMBRE(NUMERO) TO AUXIL.
                      MOVE NOMBRE(NUMAS1) TO NOMBRE(NUMERO).
                      MOVE AUXIL TO NOMBRE(NUMAS1).

      * EL BULCE INTERIOR SE EJECUTA 9 VECES.

            IF NUMERO < 9 GO TO ORDENACION2.
       FINORDENACION.

      * EL BUCLE EXTERIOR SE EJECUTARA 10 VECES.

            IF VECES < 10 GO TO ORDENACION1.
            MOVE 0 TO NUMERO.
            MOVE 8 TO VECES.

            DISPLAY "RESULTADO" LINE 6 POSITION 30 ERASE.
       IMPRIME.

      * UNA VEZ ORDENADOS SE IMPRIME LOS DIEZ NOMBRES, SE.
      * UTILIZA LA VARIABLE VECES COMO LINE PARA IMPRIMIRLOS.
      * TODOS EN LA MISMA COLUMNA UNA LINEA BAJO OTRA.

            COMPUTE NUMERO = NUMERO + 1.
            COMPUTE VECES = VECES + 1.
            DISPLAY NOMBRE(NUMERO) LINE VECES POSITION 40.
            IF NUMERO < 10 GO TO IMPRIME.

            STOP RUN.
       END PROGRAM SRC-AMP-IO.
